porousVent/grillcases/grill/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.002;

boundaryField
{
    frontAndBack
    {
        type            kqRWallFunction;
        value           uniform 0.002;
    }
    topAndBottom
    {
        type            kqRWallFunction;
        value           uniform 0.002;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.002;
    }
    outlet	
    {
        type            inletOutlet;
	inletValue	uniform 0.002;
	value		$internalField;
    }
}


// ************************************************************************* //
